# Найти факториалы чисел от 1 до 5 (включительно).

for c in range(1,6):

    print('*'* c)
for b in range(5,0,-1):
    print('*'*b)

#leetcode codewars for while cycles