'''Напишите программу для вывода на экран чисел от 0 до 100
Вам понадобиться цикл for, конструкция range и print'''

for i in range(1, 101):
    print(i)